#+TITLE: sexp
#+SETUPFILE: ~/org/clean.theme
S-Expressions. (WIP)

- [ ] Serde (Rust)
  - [ ] {lib,tests}.rs
    - [ ] ser
    - [ ] de
- [ ] Emacs Lisp
- [ ] Common Lisp
- [ ] Scheme

* Introduction
[[https://en.wikipedia.org/wiki/S-expression][S-expressions]] are tree-like data structures classically defined as:
1. an atom of the form ~x~, or
2. an expression of the form ~(x . y)~ where x and y are
   S-expressions.

In modern times we define an additional shorthand for S-expressions
with more than 2 members:
3. ~(x y z)~ may be interpreted as ~(x . (y . (z . NIL)))~ where NIL
   is the special end-of-list object (alternatively written as ~()~).

S-expressions are used for both data and code in the Lisp family of
languages, and these are the rules that pretty much every
implementation has agreed on. S-expressions are in fact one of the
features that maintains that strong familial bond between Lisps.

You can write executable code:
#+begin_src emacs-lisp :export code :results silent
  (defmacro my-data (&rest data)
    "Print '(my-data ,@DATA)'. This is a macro so that we avoid
   evaluation of DATA."
    (print (format "%S" `,(cons 'my-data data))))
#+end_src

or structured data:
#+begin_src emacs-lisp :export both
  (my-data :checksum 12795862 :frame (0 1 1 0 1 0 0 0))
#+end_src

#+RESULTS:
: (my-data :checksum 12795862 :frame (0 1 1 0 1 0 0 0))

with the same general structure. S-expressions are a building material
which exhibits the most fundamental of 'dualities of syntax' as Doug
Hoyte would call it.

However, of upmost importance is that this duality /only applies to
Lisps/. S-expressions aren't that special to non-Lispers - they are at
best a poorly supported and obscure data format and at worst an
absolute nuisance which is obsolete.

To compensate for this, us Lisp guys like to implement Lisp
interpreters wherever we go:

"See?" we say, "You can use it to execute code!"
as we type ~(+ 2 2)~ in the REPL and print ~4~.

Realistically, why do we need this? We already have a general purpose
language (the one you used to implement your Lisp), we already have a
portable data format which is supported by our language's standard
library.[fn:1]

The honest and fair truth is that *languages don't need Lisp*.

However, it may be the case that languages need S-expressions and by
extension, S-expressions need some additional rules. We will call this
extended definition *SEXP*.

[fn:1] There are good reasons for needing Lisp, just not in this case.

